ffdev-fr/lorawan_esp32_gw/main/ESP32WifiConnector.c
/*****************************************************************************************//**
 * @file     ESP32WifiConnector.c
 *
 * @author   F.Fargon 
 *
 * @version  V1.0
 *
 * @date     22/04/2018
 *
 * @brief    The 'CESP32WifiConnector' object uses the native WIFI hardware/software of ESP32 
 *           device to implement the 'IServerConnector' interface.
 *
 * @details  The 'ESP32WifiConnector' is used by the gateway to access the Lora Network Server
 *           via WIFI.\n 
 *           The 'IServerConnector' interface exposes generic functions for connection and data
 *           transfer (assuming that distant server is connected to the network with TCP/IP
 *           protocol). The 'ESP32WifiConnector' implements these functions using the ESP32 WIFI
 *           hardware and software.\n
 *           Once instantiated the 'CESP32WifiConnector' object is publicly accessed using the
 *           'IServerConnector' interface.
 *
 * @note     The client object must call the 'ReleaseItf' method on 'IServerConnector' interface 
 *           to destroy the 'CESP32WifiConnector' object created by 'CreateInstance'.
 *
 * @note     The "LoRaWAN ESP32 Gateway V1.x" project is designed for execution on ESP32 
 *           Module (Dev.C kit).\n
 *           The implementation uses the Espressif IDF V3.0 framework (with RTOS)              
*********************************************************************************************/


/*********************************************************************************************
  Espressif framework includes
*********************************************************************************************/

#include <Common.h>


/*********************************************************************************************
  Includes for object implementation
*********************************************************************************************/

// The CESP32WifiConnector object implements the 'IServerConnector' interface
#define SERVERCONNECTORITF_IMPL

#include "ServerManagerItf.h"
#include "ServerConnectorItf.h"
#include "ESP32WifiConnectorItf.h"

// Object's definitions and methods
#include "ESP32WifiConnector.h"
         
    
/*********************************************************************************************
  Instantiate global static objects used by module implementation
*********************************************************************************************/

// 'IServerConnector' interface function pointers
CServerConnectorItfImplOb g_ServerConnectorItfImplOb = { .m_pAddRef = CESP32WifiConnector_AddRef,
                                                         .m_pReleaseItf = CESP32WifiConnector_ReleaseItf,
                                                         .m_pInitialize = CESP32WifiConnector_Initialize,
                                                         .m_pStart = CESP32WifiConnector_Start,
                                                         .m_pStop = CESP32WifiConnector_Stop,
                                                         .m_pSend = CESP32WifiConnector_Send,
                                                         .m_pSendReceive = CESP32WifiConnector_SendReceive,
                                                         .m_pDownlinkReceived = CESP32WifiConnector_DownlinkReceived
                                                       };


/********************************************************************************************* 

 CLoraServerManager Class

*********************************************************************************************/



/********************************************************************************************* 
  Public methods of CESP32WifiConnector object
 
  These methods are exposed on object's public interfaces
*********************************************************************************************/

/*********************************************************************************************
  Object instance factory
 
  The factory contains one method used to create a new object instance.
  This method provides the 'IServerConnector' interface object for object's use and destruction.
*********************************************************************************************/


/*****************************************************************************************//**
 * @fn         IServerConnector CESP32WifiConnector_CreateInstance()
 * 
 * @brief      Creates a new instance of CESP32WifiConnector object.
 * 
 * @details    A new instance of CESP32WifiConnector object is created and its 'IServerConnector'
 *             interface is returned. The owner object uses this interface to configure and 
 *             control associated 'ServerConnector'.
 *
 * @return     A 'IServerConnector' interface object.\n
 *             The reference count for returned 'IServerConnector' interface is set to 1.
 *
 * @note       The CESP32WifiConnector object and associated 'ServerConnector' objects are
 *             created but nothing is initialized (i.e. only object allocations).
 *             The 'IServerConnector_Initialize' method must be called to configure the 
 *             'ServerConnector'.
 *
 * @note       The CESP32WifiConnector object is destroyed when the last reference to 
 *             'IServerConnector' is released (i.e. call to 'IServerConnector_ReleaseItf' 
 *             method).
*********************************************************************************************/
IServerConnector CESP32WifiConnector_CreateInstance()
{
  CESP32WifiConnector * pESP32WifiConnector;
     
  // Create the object
  if ((pESP32WifiConnector = CESP32WifiConnector_New()) != NULL)
  {

    // Create the 'IServerConnector' interface object
    if ((pESP32WifiConnector->m_pServerConnectorItf = 
        IServerConnector_New(pESP32WifiConnector, &g_ServerConnectorItfImplOb)) != NULL)
    {
      ++(pESP32WifiConnector->m_nRefCount);
    }
    return pESP32WifiConnector->m_pServerConnectorItf;
  }

