ffdev-fr/lorawan_esp32_gw/main/ESP32WifiConnector.c
  return NULL;
}

/*********************************************************************************************
  Public methods exposed on 'IServerConnector' interface
 
  The static 'CESP32WifiConnectorItfImplOb' object is initialized with pointers to these functions.
  The static 'CESP32WifiConnectorItfImplOb' object is referenced in the 'IServerConnector'
  interface provided by 'CreateInstance' method (object factory).
*********************************************************************************************/


/*****************************************************************************************//**
 * @fn         uint32_t CESP32WifiConnector_AddRef(void *this)
 * 
 * @brief      Increments the object's reference count.
 * 
 * @details    This function increments object's global reference count.\n
 *             The reference count is used to track the number of existing external references
 *             to 'IServerConnector' interface implemented by CESP32WifiConnector object.
 * 
 * @param      this
 *             The pointer to CESP32WifiConnector object.
 *  
 * @return     The value of reference count once incremented.
*********************************************************************************************/
uint32_t CESP32WifiConnector_AddRef(void *this)
{
  return ++((CESP32WifiConnector *)this)->m_nRefCount;
}

/*****************************************************************************************//**
 * @fn         uint32_t CESP32WifiConnector_ReleaseItf(void *this)
 * 
 * @brief      Decrements the object's reference count.
 * 
 * @details    This function decrements object's global reference count and destroy the object
 *             when count reaches 0.\n
 *             The reference count is used to track the number of existing external references
 *             to 'IServerConnector' interface implemented by CESP32WifiConnector object.
 * 
 * @param      this
 *             The pointer to CESP32WifiConnector object.
 *  
 * @return     The value of reference count once decremented.
*********************************************************************************************/
uint32_t CESP32WifiConnector_ReleaseItf(void *this)
{
  // Delete the object if its interface reference count reaches zero
  if (((CESP32WifiConnector *)this)->m_nRefCount == 1)
  {
    // TO DO -> Stop the object master task which will delete the object on exit
    CESP32WifiConnector_Delete((CESP32WifiConnector *)this);
    return 0;
  }
  return --((CESP32WifiConnector *)this)->m_nRefCount;
}

/*****************************************************************************************//**
 * @fn         bool CESP32WifiConnector_Initialize(void *this, void *pParams)
 * 
 * @brief      Initializes the 'ESP32WifiConnector' object.
 * 
 * @details    This function prepares the 'ESP32WifiConnector' for radio transmissions.\n
 *             The default connection parameters are set and the 'ESP32WifiConnector' is waiting
 *             ready in 'StandBy' mode.
 * 
 * @param      this
 *             The pointer to CESP32WifiConnector object.
 *  
 * @param      pParams
 *             The method parameters (see 'ServerConnectorItf.h' for details).
 *
 * @return     The returned value is 'true' if the 'ESP32WifiConnector' is initialized or 
 *             'false' in case of error.
*********************************************************************************************/
bool CESP32WifiConnector_Initialize(void *this, void *pParams)
{
  return CESP32WifiConnector_NotifyAndProcessCommand((CESP32WifiConnector *) this,
                                                     ESP32WIFICONNECTOR_AUTOMATON_CMD_INITIALIZE,
                                                     ESP32WIFICONNECTOR_AUTOMATON_MAX_SYNC_CMD_DURATION, 
                                                     pParams);
}

bool CESP32WifiConnector_Start(void *this, void *pParams)
{
  return CESP32WifiConnector_NotifyAndProcessCommand((CESP32WifiConnector *) this,
                                                     ESP32WIFICONNECTOR_AUTOMATON_CMD_START, 0, pParams);
}

bool CESP32WifiConnector_Stop(void *this, void *pParams)
{
  return CESP32WifiConnector_NotifyAndProcessCommand((CESP32WifiConnector *) this,
                                                     ESP32WIFICONNECTOR_AUTOMATON_CMD_STOP, 0, pParams);
}

bool CESP32WifiConnector_Send(void *this, void *pParams)
{
  return CESP32WifiConnector_NotifyAndProcessCommand((CESP32WifiConnector *) this,
                                                     ESP32WIFICONNECTOR_AUTOMATON_CMD_SEND, 0, pParams);
}

bool CESP32WifiConnector_SendReceive(void *this, void *pParams)
{
  return CESP32WifiConnector_NotifyAndProcessCommand((CESP32WifiConnector *) this,
                                                     ESP32WIFICONNECTOR_AUTOMATON_CMD_SENDRECEIVE, 0, pParams);
}

bool CESP32WifiConnector_DownlinkReceived(void *this, void *pParams)
{
  return CESP32WifiConnector_NotifyAndProcessCommand((CESP32WifiConnector *) this,
                                                     ESP32WIFICONNECTOR_AUTOMATON_CMD_DOWNLINKRECEIVED, 0, pParams);
}

/********************************************************************************************* 
  Private methods of CESP32WifiConnector object
 
  The following methods CANNOT be called by another object
*********************************************************************************************/

/*****************************************************************************************//**
 * @fn         bool CESP32WifiConnector_NotifyAndProcessCommand(CESP32WifiConnector *this, 
 *                                                           DWORD dwCommand, void *pCmdParams)
 * 
 * @brief      Process a command issued by a method of 'IESP32WifiConnector' interface.
 * 
 * @details    The CESP32WifiConnector main automaton asynchronously executes the commands generated
 *             by calls on 'IServerConnector' interface methods.\n
 *             This method transmits commands to main automaton and wait for end of execution
 *             (i.e. from client point of view, the interface method is synchronous).
 * 
 * @param      this
 *             The pointer to CESP32WifiConnector object.
 *  
 * @param      dwCommand
 *             The command to execute (typically same name than corresponding method on
 *             'IServerConnector' interface. See 'ESP32WIFICONNECTOR_AUTOMATON_CMD_xxx' in 
 *             ESP32WifiConnector.h.
 *  
 * @param      dwTimeout
 *             Specific timeout for the command. If the value is 0, the standard timeout is
 *             used.
 *
 * @param      pCmdParams
 *             A pointer to command parameters. The object pointed by 'pCmdParams' depends
 *             on method invoked on 'IServerConnector' interface. 
 *             See 'ServerConnectorItf.h'.
 *  
 * @return     The returned value is 'true' if the command is properly executed or 'false'
 *             if command execution has failed or is still pending.
 *
 * @note       This function assumes that commands are quickly processed by main automaton.\n
 *             The maximum execution time can be configured and a mechanism is implemented in
 *             order to ignore client commands sent when a previous command is still pending.
*********************************************************************************************/
bool CESP32WifiConnector_NotifyAndProcessCommand(CESP32WifiConnector *this, DWORD dwCommand, DWORD dwTimeout, void *pCmdParams)
{
  // Automaton commands are serialized (and should be quickly processed)
  // Note: In current design, there is only one client object for a single CESP32WifiConnector
  //       instance (the main task on program startup and for operation control). In other 
  //       words, commands are serialized here and there is no concurrency on the 
  //       'CESP32WifiConnector_NotifyAndProcessCommand' method.
  if (xSemaphoreTake(this->m_hCommandMutex, pdMS_TO_TICKS(ESP32WIFICONNECTOR_AUTOMATON_MAX_CMD_DURATION)) == pdFAIL)
  {
    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
      DEBUG_PRINT_LN("[ERROR] CESP32WifiConnector_NotifyAndProcessCommand - Failed to take mutex");
    #endif

