ffdev-fr/lorawan_esp32_gw/main/ESP32WifiConnector.c
    return false;
  }

  // Make sure that previous command has been processed by the automaton
  if (this->m_dwCommand != ESP32WIFICONNECTOR_AUTOMATON_CMD_NONE)
  {
    // Previous call to this function has returned before end of command's execution
    // Check if done now
    if (xSemaphoreTake(this->m_hCommandDone, 0) == pdFAIL)
    {
      // Still not terminated
      #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
        DEBUG_PRINT_LN("[ERROR] CESP32WifiConnector_NotifyAndProcessCommand - Previous command still pending");
      #endif

      xSemaphoreGive(this->m_hCommandMutex);
      return false;
    }
  }

  // Post the command to main automaton
  this->m_dwCommand = dwCommand;
  this->m_pCommandParams = pCmdParams;
  CESP32WifiConnector_MessageOb QueueMessage;
  QueueMessage.m_wMessageType = ESP32WIFICONNECTOR_AUTOMATON_MSG_COMMAND;

  DEBUG_PRINT_LN("[DEBUG] CESP32WifiConnector_NotifyAndProcessCommand - Sending command (via ESP32WifiConnector' queue)");

  if (xQueueSend(this->m_hWifiConnectorQueue, &QueueMessage, pdMS_TO_TICKS(ESP32WIFICONNECTOR_AUTOMATON_MAX_CMD_DURATION / 2)) != pdPASS)
  {
    // Message queue is full
    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
      DEBUG_PRINT_LN("[ERROR] CESP32WifiConnector_NotifyAndProcessCommand - Message queue full");
    #endif

    xSemaphoreGive(this->m_hCommandMutex);
    return false;
  }

  // Wait for command execution by main automaton
  if (dwTimeout == 0)
  {
    dwTimeout = ESP32WIFICONNECTOR_AUTOMATON_MAX_CMD_DURATION - (ESP32WIFICONNECTOR_AUTOMATON_MAX_CMD_DURATION / 5); 
  }
  else
  {
    dwTimeout -= ESP32WIFICONNECTOR_AUTOMATON_MAX_CMD_DURATION / 5;
  }
  BaseType_t nCommandDone = xSemaphoreTake(this->m_hCommandDone, pdMS_TO_TICKS(dwTimeout));

  // If the command has been processed, clear 'm_dwCommand' attribute
  if (nCommandDone == pdPASS)
  {
    this->m_dwCommand = ESP32WIFICONNECTOR_AUTOMATON_CMD_NONE;
  }
  else
  {
    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
      DEBUG_PRINT_LN("[ERROR] CESP32WifiConnector_NotifyAndProcessCommand - Exiting before end of command execution");
    #endif
  }

  // Next command allowed
  xSemaphoreGive(this->m_hCommandMutex);

  return nCommandDone == pdPASS ? true : false;
}

/********************************************************************************************* 
  RTOS task functions
*********************************************************************************************/


/********************************************************************************************* 
  'WifiConnector' task
 
  This RTOS 'Task' is the main automaton of 'CESP32WifiConnector' object:
   - It processes messages sent via 'IServerConnector' interface for comfiguration and 
     operation execution on the ESP32 Wifi device.
*********************************************************************************************/

/*****************************************************************************************//**
 * @fn         void CESP32WifiConnector_WifiConnectorAutomaton(CESP32WifiConnector *this)
 * 
 * @brief      Executes the 'WifiConnector' automaton.
 * 
 * @details    This function is the RTOS task implementing the CESP32WIfiConnector main automaton.\n
 *             This automation processes the following messages:\n
 *               - Messages sent via 'IServerConnector' interface for configuration and 
 *                 operation execution on the ESP32 Wifi device.
 *
 * @param      this
 *             The pointer to CESP32WifiConnector object.
 *  
 * @return     The RTOS task terminates when object is deleted (typically on main program
 *             exit).
 *
 * @note       The automaton's main loop waits for messages received through an RTOS queue.
*********************************************************************************************/
void CESP32WifiConnector_WifiConnectorAutomaton(CESP32WifiConnector *this)
{
  CESP32WifiConnector_MessageOb QueueMessage;

  while (this->m_dwCurrentState != ESP32WIFICONNECTOR_AUTOMATON_STATE_TERMINATED)
  {
    if (this->m_dwCurrentState >= ESP32WIFICONNECTOR_AUTOMATON_STATE_CREATED)
    {
      #if (ESP32WIFICONNECTOR_DEBUG_LEVEL2)
        DEBUG_PRINT_LN("[DEBUG] CESP32WifiConnector_WifiConnectorAutomaton, waiting message");
      #endif
  
      // Wait for messages
      if (xQueueReceive(this->m_hWifiConnectorQueue, &QueueMessage, pdMS_TO_TICKS(500)) == pdPASS)
      {
        // Process message
        #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
          DEBUG_PRINT_CR;
          DEBUG_PRINT("[INFO] CESP32WifiConnector_WifiConnectorAutomaton, message received: ");
          DEBUG_PRINT_HEX(QueueMessage.m_wMessageType);
          DEBUG_PRINT_CR;
        #endif
  
        if (QueueMessage.m_wMessageType == ESP32WIFICONNECTOR_AUTOMATON_MSG_COMMAND)
        {
          // Command message (i.e. external message via 'IServerConnector' interface
          // Note: The command is defined by 'm_dwCommand' and 'm_pCommandParams' variables
          //       (i.e. commands are serialized, never more than one command waiting in
          //       automaton's queue) 
          CESP32WifiConnector_ProcessAutomatonNotifyCommand(this);
        }
      }
      else
      {
        // No pending message for a while, maybe something to do in background
        // 
        // TO CHECK: Connectors are event driven with timeout, normally nothing to do!
        #if (ESP32WIFICONNECTOR_DEBUG_LEVEL2)
          DEBUG_PRINT_LN("[DEBUG] CESP32WifiConnector_WifiConnectorAutomaton, idle - TO DO - maybe something in background");
        #endif
      }
    }
    else
    {
      // Parent object not ready, wait for end of object's construction
      #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
        DEBUG_PRINT_CR;
        DEBUG_PRINT("CESP32WifiConnector_WifiConnectorAutomaton, waiting, state: ");
        DEBUG_PRINT_HEX(this->m_dwCurrentState);
        DEBUG_PRINT_CR;
      #endif

      vTaskDelay(pdMS_TO_TICKS(100));
    }
  }

  // Main automaton terminated (typically 'CLoraServerManager' being deleted)
  vTaskDelete(NULL);
  this->m_hWifiConnectorTask = NULL;
}

/********************************************************************************************* 
  'Receive' task
 
