ffdev-fr/lorawan_esp32_gw/main/ESP32WifiConnector.c
  This RTOS 'Task' is used to receive messages sent by Network Server and transmit them to
  'ServerManager' (direct notification using dedicated queue specified in 'IServerManagerItf')

*********************************************************************************************/

/*****************************************************************************************//**
 * @fn         void CESP32WifiConnector_ReceiveAutomaton(CESP32WifiConnector *this)
 * 
 * @brief      Waits for messages sent by Network Server. Received messages are transmited
 *             to 'CLoraServerManager".
 * 
 * @details    This function is the RTOS task used to receive downlink messages sent by the
 *             Network Server.
 *             Received message are transmited to 'CLoraServerManager' by direct notification
 *             to a dedicated task (see 'IServerManagerItf'):
 *              - The object uses a small buffer to allow reception of some messages in case 
 *                of delayed processing by 'CLoraServerManager'
 *              - The 'CLoraServerManager' asks the 'ProtocolEngine' to process message's raw
 *                data in order to build a LoRa packet.
 *              - When message is decoded by 'ProtocolEngine', the 'CLoraServerManager' releases
 *                the message buffer in 'Connector' object (via 'IServerConnector_DownlinkReceived')
 * 
 * @param      this
 *             The pointer to CLoraNodeManager object.
 *  
 * @return     The RTOS task terminates when object is deleted (typically on main program
 *             exit).
*********************************************************************************************/
void CESP32WifiConnector_ReceiveAutomaton(CESP32WifiConnector *this)
{
  socklen_t addrLen = sizeof(this->m_ServerSockAddr); 
  int retCode;
  BYTE *pMessageData;
  CMemoryBlockArrayEntryOb MemBlockEntry;
  CServerConnectorItf_ConnectorEventOb ConnectorEvent;
  CServerConnectorItf_ServerDownlinkMessage pDownlinkMessage;

  ConnectorEvent.m_wConnectorEventType = SERVERCONNECTOR_CONNECTOREVENT_DOWNLINK_RECEIVED;
  pDownlinkMessage = &ConnectorEvent.m_DownlinkMessage;

  while (this->m_dwCurrentState != ESP32WIFICONNECTOR_AUTOMATON_STATE_TERMINATED)
  {
    if (this->m_dwCurrentState == ESP32WIFICONNECTOR_AUTOMATON_STATE_RUNNING)
    {
      #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
        DEBUG_PRINT_LN("[INFO] CESP32WifiConnector_ReceiveAutomaton, receiving message");
      #endif

      // Step 1 - Obtain a 'MemoryBlock' to store received message data
      if ((pMessageData = CMemoryBlockArray_GetBlock(this->m_pServerMessageArray, &MemBlockEntry)) == NULL)
      {
        // Should never occur. Buffer for messages exhausted
        // Note: No recovery mechanism = for stress test in current version
        #if (LORASERVERMANAGER_DEBUG_LEVEL0)
          DEBUG_PRINT_LN("[ERROR] Message receive buffer exhausted. Entering 'ERROR' state");
          this->m_dwCurrentState = ESP32WIFICONNECTOR_AUTOMATON_STATE_ERROR;
        #endif

        continue;
      }

      // Step 2 - Receive data
      //
      // Note: Should use a non blocking mechanism (TO DO, check if possible)
      while (1)
      {
        #if (ESP32WIFICONNECTOR_DEBUG_LEVEL2)
          DEBUG_PRINT_LN("[DEBUG] CESP32WifiConnector_ReceiveAutomaton, calling recvfrom (blocking)");
        #endif

        retCode = recvfrom(this->m_hServerSocket, pMessageData, ESP32WIFICONNECTOR_MAX_MESSAGELENGTH, 0, 
                           (struct sockaddr *) &this->m_ServerSockAddr, &addrLen);
  
        #if (ESP32WIFICONNECTOR_DEBUG_LEVEL2)
          DEBUG_PRINT_LN("[DEBUG] 'CESP32WifiConnector_ReceiveAutomaton' - After recvfrom, ticks: ");
          DEBUG_PRINT_DEC((DWORD) xTaskGetTickCount());
          DEBUG_PRINT_CR;
        #endif

        #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
          DEBUG_PRINT("[INFO] 'CESP32WifiConnector_ReceiveAutomaton' - Return from recvfrom, code(or length) = ");
          DEBUG_PRINT_DEC(retCode);
          DEBUG_PRINT_CR;
        #endif
  
        if (retCode < 0)
        {
          // No data received, wait until end of timeout if 'EWOULDBLOCK'
          if (retCode == EWOULDBLOCK)
          {
            #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
              DEBUG_PRINT("[INFO] 'CESP32WifiConnector_ReceiveAutomaton' - EWOULDBLOCK, still waiting");
            #endif
          }
          else
          {
            // Receive error
            #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
              DEBUG_PRINT_LN("[ERROR] 'CESP32WifiConnector_ReceiveAutomaton' - Unable to receive message, ignored, trying again");
            #endif
  
            break;
          }
        }
        else
        {
          // Data received from the NetworkServer, transmit it to 'ServerManager'
          pDownlinkMessage->m_pConnectorItf = this->m_pServerConnectorItf;
          pDownlinkMessage->m_dwMessageId = (DWORD) MemBlockEntry.m_usBlockIndex;
          pDownlinkMessage->m_dwTimestamp = xTaskGetTickCount() * portTICK_RATE_MS; 
          pDownlinkMessage->m_pData = pMessageData;
          pDownlinkMessage->m_wDataSize = (WORD) retCode;

          if (xQueueSend(this->m_hServerManagerNotifyQueue, &ConnectorEvent, 0) != pdPASS)
          {
            // Queue should be long enough to always accept messages received by 'Connector'
            // If no room available for notification, the message is discarded (and lost)
            // TO DO: possible to delay the notification and allow reception of next message
            #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
              DEBUG_PRINT_LN("[ERROR] CESP32WifiConnector_ReceiveAutomaton - ServerManager notification queue full, message lost!");
            #endif

            CMemoryBlockArray_ReleaseBlock(this->m_pServerMessageArray, MemBlockEntry.m_usBlockIndex);
          }

          // Receive next message
          break;
        }
      }
    }
    else
    {
      // Parent object not ready, wait for end of object's initialization
      vTaskDelay(pdMS_TO_TICKS(100));
    }
  }

  // Main automaton terminated (typically 'CESP32WifiConnector' being deleted)
  vTaskDelete(NULL);
  this->m_hReceiveTask = NULL;
}



/*********************************************************************************************
  Construction

  Protected methods : must be called only object factory and 'IServerConnector' interface
*********************************************************************************************/

/*****************************************************************************************//**
 * @fn         CESP32WifiConnector * CESP32WifiConnector_New()
 * 
 * @brief      Object construction.
 * 
 * @details    
 * 
 * @return     The function returns the pointer to the CESP32WifiConnector instance.
 *
 * @note       This function only creates the object and its dependencies (RTOS objects).\n
*********************************************************************************************/
CESP32WifiConnector * CESP32WifiConnector_New()
{
  CESP32WifiConnector *this;

#if ESP32WIFICONNECTOR_DEBUG_LEVEL2
  printf("CESP32WifiConnector_New -> Debug level 2 (DEBUG)\n");
#elif ESP32WIFICONNECTOR_DEBUG_LEVEL1
  printf("CESP32WifiConnector_New -> Debug level 1 (INFO)\n");
#elif ESP32WIFICONNECTOR_DEBUG_LEVEL0
  printf("CESP32WifiConnector_New -> Debug level 0 (NORMAL)\n");
#endif 

