ffdev-fr/lorawan_esp32_gw/main/ESP32WifiConnector.c
  if ((this = (void *) pvPortMalloc(sizeof(CESP32WifiConnector))) != NULL)
  {
    // The 'CESP32WifiConnector' is under construction (i.e. embedded tasks must wait the 'INITIALIZED' state
    this->m_dwCurrentState = ESP32WIFICONNECTOR_AUTOMATON_STATE_CREATING;
    this->m_dwConnectionState = ESP32WIFICONNECTOR_CONNECTION_STATE_DISCONNECTED;

    // Embedded objects are not defined (i.e. created below)
    this->m_pServerMessageArray = this->m_hCommandMutex = this->m_hCommandDone = this->m_hWifiConnectorTask = 
      this->m_hWifiConnectorQueue = this->m_hWifiEventGroup = this->m_hConnectionStateMutex = 
      this->m_hReceiveTask = NULL;


    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL2)
      DEBUG_PRINT_LN("[DEBUG] CESP32WifiConnector_New Entering: create object 1");
    #endif

    if ((this->m_pServerMessageArray = CMemoryBlockArray_New(ESP32WIFICONNECTOR_MAX_MESSAGELENGTH,
        ESP32WIFICONNECTOR_MAX_SERVERMESSAGES)) == NULL)
    {
      CESP32WifiConnector_Delete(this);
      return NULL;
    }

    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL2)
      DEBUG_PRINT_LN("[DEBUG] CESP32WifiConnector_New Entering: create object 2");
    #endif

    // Create WifiConnector automaton task
    if (xTaskCreate((TaskFunction_t) CESP32WifiConnector_WifiConnectorAutomaton, "CESP32WifiConnector_WifiConnectorAutomaton", 
        2048, this, 5, &(this->m_hWifiConnectorTask)) == pdFAIL)
    {
      CESP32WifiConnector_Delete(this);
      return NULL;
    }

    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL2)
      DEBUG_PRINT_LN("[DEBUG] CESP32WifiConnector_New Entering: create object 3");
    #endif

    if ((this->m_hCommandMutex = xSemaphoreCreateMutex()) == NULL)
    {
      CESP32WifiConnector_Delete(this);
      return NULL;
    }

    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL2)
      DEBUG_PRINT_LN("[DEBUG] CESP32WifiConnector_New Entering: create object 4");
    #endif

    if ((this->m_hCommandDone = xSemaphoreCreateBinary()) == NULL)
    {
      CESP32WifiConnector_Delete(this);
      return NULL;
    }

    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL2)
      DEBUG_PRINT_LN("[DEBUG] CESP32WifiConnector_New Entering: create object 5");
    #endif

    // Message queue associated to 'WifiConnector' task
    // Used for internal messages and external commands via 'IServerConnector' interface
    if ((this->m_hWifiConnectorQueue = xQueueCreate(10, sizeof(CESP32WifiConnector_MessageOb))) == NULL)
    {
      CESP32WifiConnector_Delete(this);
      return NULL;
    }

    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL2)
      DEBUG_PRINT_LN("[DEBUG] CESP32WifiConnector_New Entering: create object 6");
    #endif

    // EventGroup for Wifi Event Handler function
    if ((this->m_hWifiEventGroup = xEventGroupCreate()) == NULL)
    {
      CESP32WifiConnector_Delete(this);
      return NULL;
    }

    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL2)
      DEBUG_PRINT_LN("[DEBUG] CESP32WifiConnector_New Entering: create object 7");
    #endif

    if ((this->m_hConnectionStateMutex = xSemaphoreCreateMutex()) == NULL)
    {
      CESP32WifiConnector_Delete(this);
      return NULL;
    }

    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL2)
      DEBUG_PRINT_LN("[DEBUG] CESP32WifiConnector_New Entering: create object 8");
    #endif
    
    // Create the task used to receive downlink messages
    if (xTaskCreate((TaskFunction_t) CESP32WifiConnector_ReceiveAutomaton, "CESP32WifiConnector_ReceiveAutomaton", 
        2048, this, 5, &(this->m_hReceiveTask)) == pdFAIL)
    {
      CESP32WifiConnector_Delete(this);
      return NULL;
    }

    // The owner object is not defined (i.e. done on 'Initialize' command)
    this->m_hServerManagerNotifyQueue = NULL;

    // Initialize object's properties
    this->m_nRefCount = 0;
    this->m_dwCommand = ESP32WIFICONNECTOR_AUTOMATON_CMD_NONE;
    this->m_hServerSocket = -1;

    // Enter the 'CREATED' state
    this->m_dwCurrentState = ESP32WIFICONNECTOR_AUTOMATON_STATE_CREATED;

  }
  return this;
}

/*****************************************************************************************//**
 * @fn         void CESP32WifiConnector_Delete(CESP32WifiConnector *this)
 * 
 * @brief      Object destruction.
 * 
 * @details    Destroys the CESP32WifiConnector object.\n
 *             The associated RTOS objects are destroyed and the memory used by CESP32WifiConnector
 *             object are released.

 * @param      this
 *             The pointer to CESP32WifiConnector object.
 *  
 * @return     None.
*********************************************************************************************/
void CESP32WifiConnector_Delete(CESP32WifiConnector *this)
{
  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL2)
    DEBUG_PRINT_LN("[DEBUG] CESP32WifiConnector_Delete Entering");
  #endif

  // Ask all tasks for termination
  // TO DO (also check how to delete task object)

  // Delete queues (TO DO)

  // Free memory
  if (this->m_pServerMessageArray != NULL)
  {
    CMemoryBlockArray_Delete(this->m_pServerMessageArray);
  }

  if (this->m_hCommandMutex != NULL)
  {
    vSemaphoreDelete(this->m_hCommandMutex);
  }
  if (this->m_hCommandDone != NULL)
  {
    vSemaphoreDelete(this->m_hCommandDone);
  }

  if (this->m_hWifiEventGroup != NULL)
  {   
    vEventGroupDelete(this->m_hWifiEventGroup);
  }
  if (this->m_hConnectionStateMutex != NULL)
  {
    vSemaphoreDelete(this->m_hConnectionStateMutex);
  }
  
  vPortFree(this);
}


/*********************************************************************************************
  Private methods (implementation)

  Command processing

  These functions are called by 'WifiConnector' automaton when the 
  'ESP32WIFICONNECTOR_AUTOMATON_MSG_COMMAND' notification is received.

  Note: These functions may change automaton state. There is no protection against concurrency
        for automaton state because only functions called from automaton RTOS task are allowed
        to modify state (by design).
*********************************************************************************************/



/*****************************************************************************************//**
 * @fn         bool CESP32WifiConnector_ProcessAutomatonNotifyCommand(CESP32WifiConnector *this)
 * 
 * @brief      Process 'IESP32WifiConnector' command currently waiting in automaton.
 * 
 * @details    This function is invoked by 'WifiConnector' automaton when it receives a 
 *             'COMMAND' notification.\n
 *             These commands are issued via calls on 'IServerConnector' interface.\n
 *             The command and its parameters are available in member variables of 
 *             CESP32WifiConnector object.\n
 *             By design, commands are serialized when transmited to CESP32WifiConnector automaton.
 *             In other words, the processing of one command cannot be interrupted by the 
 *             reception of another command.
 * 
 * @param      this
 *             The pointer to CESP32WifiConnector object.
 *  
 * @return     The returned value is 'true' if command execution is successful or 'false' in
 *             case of error.
*********************************************************************************************/
bool CESP32WifiConnector_ProcessAutomatonNotifyCommand(CESP32WifiConnector *this)
{
  bool bResult;

  switch (this->m_dwCommand)
  {
    case ESP32WIFICONNECTOR_AUTOMATON_CMD_INITIALIZE:
      bResult = CESP32WifiConnector_ProcessInitialize(this, (CESP32WifiConnectorItf_InitializeParams) this->m_pCommandParams);
      break;

//  case ESP32WIFICONNECTOR_AUTOMATON_CMD_ATTACH:
//    bResult = CESP32WifiConnector_ProcessAttach(this, (CESP32WifiConnectorItf_AttachParams) this->m_pCommandParams);
//    break;

    case ESP32WIFICONNECTOR_AUTOMATON_CMD_START:
      bResult = CESP32WifiConnector_ProcessStart(this, (CESP32WifiConnectorItf_StartParams) this->m_pCommandParams);
      break;

    case ESP32WIFICONNECTOR_AUTOMATON_CMD_STOP:
      bResult = CESP32WifiConnector_ProcessStop(this, (CESP32WifiConnectorItf_StopParams) this->m_pCommandParams);
      break;

    case ESP32WIFICONNECTOR_AUTOMATON_CMD_SEND:
      bResult = CESP32WifiConnector_ProcessSend(this, (CESP32WifiConnectorItf_SendParams) this->m_pCommandParams);
      break;

    case ESP32WIFICONNECTOR_AUTOMATON_CMD_SENDRECEIVE:
      bResult = CESP32WifiConnector_ProcessSendReceive(this, (CESP32WifiConnectorItf_SendReceiveParams) this->m_pCommandParams);
      break;

