ffdev-fr/lorawan_esp32_gw/main/ESP32WifiConnector.c
    case ESP32WIFICONNECTOR_AUTOMATON_CMD_DOWNLINKRECEIVED:
      bResult = CESP32WifiConnector_ProcessDownlinkReceived(this, (CESP32WifiConnectorItf_DownlinkReceivedParams) this->m_pCommandParams);
      break;

    default:
      #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
        DEBUG_PRINT_LN("[ERROR] CESP32WifiConnector_ProcessAutomatonNotifyCommand, unknown command");
      #endif
      bResult = false;
      break;
  }

  // Command executed, allow next command for calling task (i.e. command execution by automaton is asynchronous
  // but has synchronous behavior for calling task)
  this->m_dwCommand = ESP32WIFICONNECTOR_AUTOMATON_CMD_NONE;
  xSemaphoreGive(this->m_hCommandDone);

  return bResult;
}

/*****************************************************************************************//**
 * @fn         bool CESP32WifiConnector_ProcessInitialize(CESP32WifiConnector *this, 
 *                                            CESP32WifiConnectorItf_InitializeParams pParams)
 * 
 * @brief      Initializes the object and configure associated 'ServerConnectors'.
 * 
 * @details    This function reads the connector configuration and initializes the 
 *             'ServerConnector' (i.e. connects the Wifi network and creates UDP socket to
 *             the LoRa Network Server).\n
 *             The connection device is connected and is waiting in 'Idle' state. 
 *             The 'START' and 'STOP' commands are then available to control the activity of
 *             the object (i.e. processing of 'Send' and 'Receive' operations).\n
 *             This function must be called one time in 'CREATED' automaton state.\n
 *             On exit, possible automaton states are:\n
 *              - 'ESP32WIFICONNECTOR_AUTOMATON_STATE_INITIALIZED' = the object and connection 
 *                devices initialization is successfully completed. The Wifi connector is ready
 *                for send and receive operations with Network Server.
 *              - 'ESP32WIFICONNECTOR_AUTOMATON_STATE_ERROR' = failed to initialize Wifi connection
 *                to LoRa Network Server.
 *
 * @note       By design, the 'Initialize' method of 'ServerConnector' interface must be called 
 *             once. In case of failure, the 'CESP32WifiConnector' enter the 'TERMINATED' state 
 *             (i.e. fatal error and no possible recovery until gateway reboot).
 *             This simplified behavior is used because the failover feature for Network Server
 *             link is not required for first version of the gateway. In current version, the
 *             gateway uses the first successful link detected on boot and reboots if the link
 *             cannot be established back after failure (typically to use backup connector).
 * 
 * @param      this
 *             The pointer to CESP32WifiConnector object.
 *  
 * @param      pParams
 *             The interface method parameters (see 'ESP32WifiConnectorItf.h' for details).
 *
 * @return     The returned value is 'true' if the ESP32WifiConnector is properly initialized or
 *             'false' in case of error.
*********************************************************************************************/
bool CESP32WifiConnector_ProcessInitialize(CESP32WifiConnector *this, CESP32WifiConnectorItf_InitializeParams pParams)
{
  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    DEBUG_PRINT_CR;
    DEBUG_PRINT_LN("[INFO] Entering 'CESP32WifiConnector_ProcessInitialize'");
  #endif

  // The 'Initialize' method is allowed only in 'CREATED' and 'ERROR' automaton state
  if ((this->m_dwCurrentState != ESP32WIFICONNECTOR_AUTOMATON_STATE_CREATED) &&
      (this->m_dwCurrentState != ESP32WIFICONNECTOR_AUTOMATON_STATE_ERROR))
  {
    // By design, should never occur
    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
      DEBUG_PRINT_LN("[ERROR] Function called in invalid automaton state");
    #endif
    return false;
  }

  CServerManagerItf_ConnectorSettings pConnectorSettings = pParams->m_pConnectorSettings;

  // Interface for notifications to owner ServerManager object (direct notification using dedicated queue)
  this->m_hServerManagerNotifyQueue = pParams->m_hEventNotifyQueue;

  // DEBUG
  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    DEBUG_PRINT("[INFO] 'CESP32WifiConnector_ProcessInitialize' - Event group before config copy:");
    DEBUG_PRINT_HEX(this->m_hWifiEventGroup);
    DEBUG_PRINT_CR;
  #endif


  // Step 1: Store configuration for access to Wifi Network
  strcpy(this->m_szWifiSSID, pConnectorSettings->m_szNetworkName);
  strcpy(this->m_szWifiPassword, pConnectorSettings->m_szNetworkPassword);
  this->m_dwWifiJoinTimeoutMillisec = pConnectorSettings->m_dwNetworkJoinTimeout;

  // DEBUG
  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    DEBUG_PRINT("[INFO] 'CESP32WifiConnector_ProcessInitialize' - Event group after config copy:");
    DEBUG_PRINT_HEX(this->m_hWifiEventGroup);
    DEBUG_PRINT_CR;
  #endif

  // Step 2: Initialize ESP-IDF Wifi module for 'Station' mode
  //
  nvs_flash_init();            // Required for Wifi firmware

  // Gateway MAC Address is explicitly set (i.e. checked in UDP packet by Network Server) 
  esp_base_mac_addr_set(pParams->m_pConnectorSettings->m_GatewayMACAddr);

  tcpip_adapter_init();

  wifi_init_config_t InitConfig = WIFI_INIT_CONFIG_DEFAULT();
  bool bError = false;

  if (esp_event_loop_init(CESP32WifiConnector_WifiEventHandler, this) != ESP_OK) { bError = true; }
  else if (esp_wifi_init(&InitConfig) != ESP_OK) { bError = true; }
  else if (esp_wifi_set_storage(WIFI_STORAGE_RAM) != ESP_OK) { bError = true; }
  else if (esp_wifi_set_mode(WIFI_MODE_STA) != ESP_OK) { bError = true; }
  else if (esp_wifi_start() != ESP_OK) { bError = true; }

  if (bError == true)
  {
    // Fatal error, should never occur
    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
      DEBUG_PRINT_LN("[ERROR] CESP32WifiConnector_ProcessInitialize, unable to initialize ESP Wifi layer");
    #endif
    this->m_dwCurrentState = ESP32WIFICONNECTOR_AUTOMATON_STATE_TERMINATED;
    return false;
  }

  // Step 3: Connect the Wifi station to network
  //
  // This step blocks until connection is established (or refused)
  if (CESP32WifiConnector_JoinWifi(this, false) == false)
  {
    // Access Point not reachable, this connector cannot be used by 'ServerManager' at the moment
    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
      DEBUG_PRINT_LN("[ERROR] CESP32WifiConnector_ProcessInitialize, unable to join Wifi Access Point");
    #endif
    this->m_dwCurrentState = ESP32WIFICONNECTOR_AUTOMATON_STATE_TERMINATED;
    return false;
  }

  // Step 4: Update RTC using SNTP server if required
  //
  // This step blocks until RTC current time is updated (or failed)
  if (pConnectorSettings->m_dwSNTPServerPeriodSec != 0)
  {
    if (CESP32WifiConnector_ConnectSNTPServer(this, pConnectorSettings->m_szSNTPServerUrl, pConnectorSettings->m_dwSNTPServerPeriodSec) == false)
    {
      // SNTP Server not reachable, this connector cannot be used by 'ServerManager' at the momment
      #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
        DEBUG_PRINT_LN("[ERROR] CESP32WifiConnector_ProcessInitialize, unable to update RTC using SNTP Server");
      #endif
      this->m_dwCurrentState = ESP32WIFICONNECTOR_AUTOMATON_STATE_TERMINATED;
      return false;
    }
  }

  // Step 5: Store configuration for access to Network Server
  strcpy(this->m_szNetworkServerUrl, pConnectorSettings->m_szNetworkServerUrl);
  this->m_dwNetworkServerPort = pConnectorSettings->m_dwNetworkServerPort;
  this->m_dwNetworkServerTimeoutMillisec = pConnectorSettings->m_dwNetworkServerTimeout;

