ffdev-fr/lorawan_esp32_gw/main/ESP32WifiConnector.c
  // Step 6: Check access to Network Server (retrieve NetworkServer IP and create UDP socket)
  //
  // This step blocks until DNS has retrieved IP (or failed)
  if (CESP32WifiConnector_BindNetworkServer(this) == false)
  {
    // Unable to retrieve NetworkServer IP, this connector cannot be used by 'ServerManager' at the momment
    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
      DEBUG_PRINT_LN("[ERROR] CESP32WifiConnector_ProcessInitialize, unable retrieve Network Server IP");
    #endif
    this->m_dwCurrentState = ESP32WIFICONNECTOR_AUTOMATON_STATE_TERMINATED;
    return false;
  }



/* TO CHECK / FINISH

  // Step 5: Attach the 'ServerManager'
  //
  // The 'ServerManager' will directly notify the 'UplinkSenderAutomaton' task of 'ESP32WifiConnector'
  // when a new Lora Packet is received (to forward to Network Server)
  CTransceiverManagerItf_AttachParamsOb AttachParams;
  AttachParams.m_hPacketForwarderTask = this->m_hNodeManagerTask;

  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    DEBUG_PRINT_LN("[DEBUG] CESP32WifiConnector_ProcessInitialize, calling ITransceiverManager_Attach");
  #endif

  ITransceiverManager_Attach((ITransceiverManager) pParams->pTransceiverManagerItf, &AttachParams);
  this->m_pTransceiverManagerItf = (ITransceiverManager) pParams->pTransceiverManagerItf;

  // Adjust state of 'ESP32WifiConnector':
  //  - Enter the 'IDLE' state if the 'TransceiverManager' is already attached
  //  - Otherwise enter the 'INITIALIZED' state (i.e. the 'IDLE' state will be entered when 
  //    'TransceiverManager' will invoke the 'Attach' method)
  // Note: By design, no concurrency on automaton state variable
  if (this->m_hTransceiverManagerTask == NULL)
  {
    this->m_dwCurrentState = ESP32WIFICONNECTOR_AUTOMATON_STATE_INITIALIZED;
    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
      DEBUG_PRINT_LN("[INFO] CESP32WifiConnector automaton state changed: 'INITIALIZED'");
    #endif
  }
  else
  {
    this->m_dwCurrentState = ESP32WIFICONNECTOR_AUTOMATON_STATE_IDLE;
    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
      DEBUG_PRINT_LN("[INFO] CESP32WifiConnector automaton state changed: 'IDLE'");
    #endif
  }
      
*/


  // The 'ESP32WifiConnector' is initialized and ready to send/receive UDP packets to/from Network Server
  this->m_dwCurrentState = ESP32WIFICONNECTOR_AUTOMATON_STATE_INITIALIZED;

  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    DEBUG_PRINT_LN("[INFO] CESP32WifiConnector initialized for Wifi Network access (INITIALIZED state)");
  #endif
  return true;
}

/*

bool CESP32WifiConnector_ProcessAttach(CESP32WifiConnector *this, CESP32WifiConnectorItf_AttachParams pParams)
{
  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    DEBUG_PRINT_CR;
    DEBUG_PRINT_LN("[INFO] Entering 'CESP32WifiConnector_ProcessAttach'");
  #endif

  // The 'Attach' method is allowed only in 'CREATED' and 'INITIALIZED' automaton state
  if ((this->m_dwCurrentState != ESP32WIFICONNECTOR_AUTOMATON_STATE_CREATED) &&
      (this->m_dwCurrentState != ESP32WIFICONNECTOR_AUTOMATON_STATE_INITIALIZED))
  {
    // By design, should never occur
    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
      DEBUG_PRINT_LN("[ERROR] Function called in invalid automaton state");
    #endif
    return false;
  }

  // Check that no 'TransceiverManager' already attached
  // Command executed once at the end of startup process
  if (this->m_hTransceiverManagerTask != NULL)
  {
    // By design, should never occur
    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
      DEBUG_PRINT_LN("[ERROR] Node transceiver already attached");
    #endif
    return false;
  }

  // Note: Task in 'CLoraNodeManager' object
  this->m_hTransceiverManagerTask = pParams->m_hNodeManagerTask;

  // Enter the 'IDLE' state if current state is 'INITIALIZED' 
  // Note: By design, no concurrency on automaton state variable
  if (this->m_dwCurrentState == ESP32WIFICONNECTOR_AUTOMATON_STATE_INITIALIZED)
  {
    this->m_dwCurrentState = ESP32WIFICONNECTOR_AUTOMATON_STATE_IDLE;
    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
      DEBUG_PRINT_LN("[INFO] CESP32WifiConnector automaton state changed: 'IDLE'");
    #endif
  }

  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    DEBUG_PRINT_LN("[INFO] CESP32WifiConnector successfully attached to forwarder");
  #endif
  return true;
}

*/

bool CESP32WifiConnector_ProcessStart(CESP32WifiConnector *this, CESP32WifiConnectorItf_StartParams pParams)
{
//CLoraServerItf_ReceiveParamsOb ReceiveParams;

  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    DEBUG_PRINT_CR;
    DEBUG_PRINT_LN("[INFO] Entering 'CESP32WifiConnector_ProcessStart'");
  #endif

  // The 'Start' method is allowed only in 'IDLE' automaton state
  if (this->m_dwCurrentState != ESP32WIFICONNECTOR_AUTOMATON_STATE_IDLE)
  {
    // By design, should never occur
    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
      DEBUG_PRINT_LN("[ERROR] Function called in invalid automaton state");
    #endif
    return false;
  }

  // Enter the 'RUNNING' state
  // Note: By design, no concurrency on automaton state variable
  this->m_dwCurrentState = ESP32WIFICONNECTOR_AUTOMATON_STATE_RUNNING;
  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    DEBUG_PRINT_LN("[INFO] CESP32WifiConnector automaton state changed: 'RUNNING'");
  #endif


  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    DEBUG_PRINT_LN("[INFO] CESP32WifiConnector successfully started (ready to create sessions)");
  #endif
  return true;
}

bool CESP32WifiConnector_ProcessStop(CESP32WifiConnector *this, CESP32WifiConnectorItf_StopParams pParams)
{
  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    DEBUG_PRINT_CR;
    DEBUG_PRINT_LN("[INFO] Entering 'CESP32WifiConnector_ProcessStop'");
  #endif

  // The 'Stop' method is allowed only in 'RUNNING' automaton state
  if (this->m_dwCurrentState != ESP32WIFICONNECTOR_AUTOMATON_STATE_RUNNING)
  {
    // By design, should never occur
    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
      DEBUG_PRINT_LN("[ERROR] Function called in invalid automaton state");
    #endif
    return false;
  }

  // Enter the 'STOPPING' state
  // Note: By design, no concurrency on automaton state variable
  this->m_dwCurrentState = ESP32WIFICONNECTOR_AUTOMATON_STATE_STOPPING;
  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    DEBUG_PRINT_LN("[INFO] CESP32WifiConnector automaton state changed: 'STOPPING'");
  #endif

  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    DEBUG_PRINT_LN("[INFO] CESP32WifiConnector currently stopping (no more sessions created)");
  #endif
  return true;
}

bool CESP32WifiConnector_ProcessSend(CESP32WifiConnector *this, CESP32WifiConnectorItf_SendParams pParams)
{
  bool bResult = false;

  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    DEBUG_PRINT_LN("[INFO] Entering 'CESP32WifiConnector_ProcessSend'");
  #endif

