ffdev-fr/lorawan_esp32_gw/main/ESP32WifiConnector.c
  // The 'Send' method is allowed only in 'RUNNING' automaton state
  if (this->m_dwCurrentState == ESP32WIFICONNECTOR_AUTOMATON_STATE_RUNNING)
  {
    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
      DEBUG_PRINT("[INFO] CESP32WifiConnector - trying to send message (sendto: ");
      DEBUG_PRINT_DEC((DWORD)((CServerConnectorItf_SendParams) pParams)->m_wDataLength);
      DEBUG_PRINT_LN(" bytes)");
    #endif

    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL2)
      DEBUG_PRINT("[DEBUG] CESP32WifiConnector_ProcessSend - Before sendto, ticks: ");
      DEBUG_PRINT_DEC((DWORD) xTaskGetTickCount());
      DEBUG_PRINT_CR;
    #endif

    int nBytesSent = sendto(this->m_hServerSocket,
                            ((CServerConnectorItf_SendParams) pParams)->m_pData,
                            ((CServerConnectorItf_SendParams) pParams)->m_wDataLength, 0, 
                            (struct sockaddr *) &this->m_ServerSockAddr, sizeof(this->m_ServerSockAddr));
    if (nBytesSent != ((CServerConnectorItf_SendParams) pParams)->m_wDataLength)
    {
      #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
        DEBUG_PRINT("[ERROR] 'CESP32WifiConnector_ProcessSend' - Unable to sent message, 'sendto' failed (code: ");
        DEBUG_PRINT_DEC(nBytesSent);
        DEBUG_PRINT_CR;
      #endif
    }
    else
    {
      #if (ESP32WIFICONNECTOR_DEBUG_LEVEL2)
        DEBUG_PRINT("[DEBUG] CESP32WifiConnector_ProcessSend - After sendto, ticks: ");
        DEBUG_PRINT_DEC((DWORD) xTaskGetTickCount());
        DEBUG_PRINT_CR;
      #endif

      bResult = true;

      #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
        DEBUG_PRINT_LN("[INFO] CESP32WifiConnector_ProcessSend - message sent");
      #endif
    }
  }
  else
  {
    // By design, should never occur
    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
      DEBUG_PRINT_LN("[ERROR] CESP32WifiConnector_ProcessSend - Function called in invalid automaton state, message not sent");
    #endif
  }

  // Notify result via 'IServerManager' interface (i.e. asynchronous commnad processing)
  CServerConnectorItf_ConnectorEventOb ConnectorEvent;
  ConnectorEvent.m_wConnectorEventType = SERVERCONNECTOR_CONNECTOREVENT_SERVERMSG_EVENT;
  CServerManagerItf_ServerMessageEvent pServerMessageEvent = &ConnectorEvent.m_ServerMessageEvent;

  pServerMessageEvent->m_wEventType = bResult == true ? SERVERMANAGER_MESSAGEEVENT_UPLINK_SENT: 
                                                        SERVERMANAGER_MESSAGEEVENT_UPLINK_SEND_FAILED;
  pServerMessageEvent->m_pMessage = ((CServerConnectorItf_SendParams) pParams)->m_pMessage;
  pServerMessageEvent->m_dwParam = NULL;
//ServerMessageEvent.m_dwMessageId = ((CServerConnectorItf_SendParams) pParams)->m_dwMessageId;

  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    DEBUG_PRINT_LN("[INFO] Entering 'CESP32WifiConnector_ProcessSend' - Notifying ServerManager for send result");
  #endif

/*
  IServerManager *pDebug = ((CESP32WifiConnector *) this)->m_pServerManagerItf;

  DEBUG_PRINT("[INFO] Entering 'CESP32WifiConnector_ProcessSend' - Debug itf = ");
  DEBUG_PRINT_HEX(pDebug);
  DEBUG_PRINT_CR;
*/

//IServerManager_ServerMessageEvent(((CESP32WifiConnector *) this)->m_pServerManagerItf, &ServerMessageEvent);

  if (xQueueSend(this->m_hServerManagerNotifyQueue, &ConnectorEvent, 0) != pdPASS)
  {
    // Queue should be long enough to always accept notifications sent by 'Connector'
    // If no room available for notification, the ServerManager automaton should abort the associated session
    // (typically on timeout)
    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
      DEBUG_PRINT_LN("[ERROR] CESP32WifiConnector_ProcessSend - ServerManager notification queue full, session may fail");
    #endif
  }

  return bResult;
}

// This method is called after 'Connector' initialization to check the access to Network Server.
// If this first exchange with the Network Server is successful, the 'Connector' enters the 'IDLE' state.
bool CESP32WifiConnector_ProcessSendReceive(CESP32WifiConnector *this, CESP32WifiConnectorItf_SendReceiveParams pParams)
{
  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    DEBUG_PRINT_CR;
    DEBUG_PRINT_LN("[INFO] Entering 'CESP32WifiConnector_ProcessSendReceive'");
  #endif

  // The 'SendReceive' method is allowed only when automaton state is 'INITIALIZED' and connection state is 'SERVER_DISCONNECTED'
  // NOTE: The owner object calls this function to establish session with Network Server prior starting the 'Connector' object
  //       (i.e. method called once during object's life)
  if ((this->m_dwCurrentState != ESP32WIFICONNECTOR_AUTOMATON_STATE_INITIALIZED) ||
      (this->m_dwConnectionState != ESP32WIFICONNECTOR_CONNECTION_STATE_SERVER_DISCONNECTED))
  {
    // By design, should never occur
    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
      DEBUG_PRINT_LN("[ERROR] Function called in invalid automaton state");
    #endif
    return false;
  }




  // /////// DEBUG
//int rc = connect(this->m_hServerSocket, (struct sockaddr *) &this->m_ServerSockAddr, sizeof(this->m_ServerSockAddr));
//DEBUG_PRINT("[INFO] 'CESP32WifiConnector_ProcessSendReceive' - Connect, rc: ");
//DEBUG_PRINT_DEC(rc);
//DEBUG_PRINT_CR;
//
//rc = send(this->m_hServerSocket, pParams->m_pData, pParams->m_wDataLength, 0);
//DEBUG_PRINT("[INFO] 'CESP32WifiConnector_ProcessSendReceive' - Send, rc: ");
//DEBUG_PRINT_DEC(rc);
//DEBUG_PRINT_CR;






///*  RESTORE


  // Step 1: Send the 'ping' message to initialize Network Server session
  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    DEBUG_PRINT_LN("[INFO] 'CESP32WifiConnector_ProcessSendReceive' - Sending PING message...");
  #endif

// Debug - sendto X99 (wireshark capture)
//  this->m_ServerSockAddr.sin_addr.s_addr = ipaddr_addr("192.168.1.15");

  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL2)
    DEBUG_PRINT_LN("[DEBUG] 'CESP32WifiConnector_ProcessSendReceive' - Before sendto, ticks: ");
    DEBUG_PRINT_DEC((DWORD) xTaskGetTickCount());
    DEBUG_PRINT_CR;
  #endif

  int nBytesSent = sendto(this->m_hServerSocket, pParams->m_pData, pParams->m_wDataLength, 0,
                          (struct sockaddr *) &this->m_ServerSockAddr, sizeof(this->m_ServerSockAddr));
  if (nBytesSent != pParams->m_wDataLength)
  {
    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
      DEBUG_PRINT_LN("[ERROR] 'CESP32WifiConnector_ProcessSendReceive' - Unable to sent PING message, connector disabled");
    #endif

    close(this->m_hServerSocket);
    this->m_dwCurrentState = ESP32WIFICONNECTOR_AUTOMATON_STATE_TERMINATED;
    return false;
  }


