ffdev-fr/lorawan_esp32_gw/main/ESP32WifiConnector.c
//*/




  // TO DO -> Possible only if not using the CMD Main automaton (i.e. currently blocked in synchronous execution of THIS Command!)

  // Message sent, notify the 'ServerManager' (i.e. transmited to 'ProtocolEngine' if required) 
//CServerManagerItf_ServerMessageEventOb ServerMessageEvent;
//
//ServerMessageEvent.m_wEventType = SERVERMANAGER_MESSAGEEVENT_UPLINK_SENT;
//ServerMessageEvent.m_pMessage = pSendParams->m_pMessage;
//ServerMessageEvent.m_dwMessageId = pSendParams->m_dwMessageId;
//
//#if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
//  DEBUG_PRINT_CR;
//  DEBUG_PRINT_LN("[INFO] Entering 'CESP32WifiConnector_ProcessSendReceive' - Notifying ServerManager for message sent");
//#endif
//
//
//IServerManager_ServerMessageEvent(((CESP32WifiConnector *) this)->m_pServerManagerItf, &ServerMessageEvent);


  // Step 2: Wait for NetworkServer reply
  socklen_t addrLen = sizeof(this->m_ServerSockAddr); 
  int retCode;
  while (1)
  {
    retCode = recvfrom(this->m_hServerSocket, pParams->m_pReply, pParams->m_wReplyMaxLength, 0, 
                       (struct sockaddr *) &this->m_ServerSockAddr, &addrLen);

    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL2)
      DEBUG_PRINT_LN("[DEBUG] 'CESP32WifiConnector_ProcessSendReceive' - After recvfrom, ticks: ");
      DEBUG_PRINT_DEC((DWORD) xTaskGetTickCount());
      DEBUG_PRINT_CR;
    #endif

    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
      DEBUG_PRINT("[INFO] 'CESP32WifiConnector_ProcessSendReceive' - Return from recvfrom, code(or length) = ");
      DEBUG_PRINT_DEC(retCode);
      DEBUG_PRINT_CR;
    #endif

    if (retCode < 0)
    {
      // No data received, wait until end of timeout if 'EWOULDBLOCK'
      if (retCode == EWOULDBLOCK)
      {
        #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
          DEBUG_PRINT("[INFO] 'CESP32WifiConnector_ProcessSendReceive' - EWOULDBLOCK, still waiting");
        #endif
      }
      else
      {
        // Receive error
        #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
          DEBUG_PRINT_LN("[ERROR] 'CESP32WifiConnector_ProcessSendReceive' - Unable to receive PING reply, connector disabled");
        #endif

        close(this->m_hServerSocket);
        this->m_dwCurrentState = ESP32WIFICONNECTOR_AUTOMATON_STATE_TERMINATED;
        return false;
      }
    }
    else
    {
      // Data received from the NetworkServer. It is assumed that is the reply we are waiting for 
      // (i.e. not checked here but by associated ProtocolEngine)
      pParams->m_wReplyLength = retCode;

      // The 'ESP32WifiConnector' has validated the access to Network Server
      this->m_dwCurrentState = ESP32WIFICONNECTOR_AUTOMATON_STATE_IDLE;

      #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
        DEBUG_PRINT_LN("[INFO] 'CESP32WifiConnector_ProcessSendReceive' - First send/receive with Network Server successful (IDLE state)");
      #endif
      break;
    }
  }
  return true;
}

// The downlink message data has been processed, release the MemoryBlock to allows later use in receiving another message
bool CESP32WifiConnector_ProcessDownlinkReceived(CESP32WifiConnector *this, CESP32WifiConnectorItf_DownlinkReceivedParams pParams)
{
  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    DEBUG_PRINT_CR;
    DEBUG_PRINT_LN("[INFO] Entering 'CESP32WifiConnector_ProcessDownlinkReceived'");
  #endif

  CMemoryBlockArray_ReleaseBlock(this->m_pServerMessageArray, (WORD) pParams->m_dwMessageId);

  return true;
}


/*********************************************************************************************
  Private methods (implementation)

  Wifi network
*********************************************************************************************/

/*********************************************************************************************
  Event handler for ESP Wifi (static method)
*********************************************************************************************/

static esp_err_t CESP32WifiConnector_WifiEventHandler(void *this, system_event_t *pEvent)
{
  switch(pEvent->event_id)
  {
    case SYSTEM_EVENT_STA_GOT_IP:
      #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
        DEBUG_PRINT_LN("[INFO] 'CESP32WifiConnector_WifiEventHandler' - Event: SYSTEM_EVENT_STA_GOT_IP");
      #endif
      CESP32WifiConnector_UpdateConnectionState((CESP32WifiConnector *) this, ESP32WIFICONNECTOR_CONNECTION_EVENT_WIFI_CONNECTED);
      xEventGroupClearBits(((CESP32WifiConnector *) this)->m_hWifiEventGroup, WIFI_EVENT_GROUP_DISCONNECTED_BIT);
      xEventGroupSetBits(((CESP32WifiConnector *) this)->m_hWifiEventGroup, WIFI_EVENT_GROUP_CONNECTED_BIT);
      break;

    case SYSTEM_EVENT_STA_DISCONNECTED:
      #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
        DEBUG_PRINT_LN("[INFO] 'CESP32WifiConnector_WifiEventHandler' - Event: SYSTEM_EVENT_STA_DISCONNECTED");
      #endif
      CESP32WifiConnector_UpdateConnectionState((CESP32WifiConnector *) this, ESP32WIFICONNECTOR_CONNECTION_EVENT_WIFI_DISCONNECTED);
      xEventGroupClearBits(((CESP32WifiConnector *) this)->m_hWifiEventGroup, WIFI_EVENT_GROUP_CONNECTED_BIT);
      xEventGroupSetBits(((CESP32WifiConnector *) this)->m_hWifiEventGroup, WIFI_EVENT_GROUP_DISCONNECTED_BIT);
      break;

    case SYSTEM_EVENT_STA_CONNECTED:
    case SYSTEM_EVENT_STA_LOST_IP:
    case SYSTEM_EVENT_STA_START:
    case SYSTEM_EVENT_STA_STOP:
    case SYSTEM_EVENT_STA_WPS_ER_FAILED:
    case SYSTEM_EVENT_STA_WPS_ER_PIN:
    case SYSTEM_EVENT_STA_WPS_ER_SUCCESS:
    case SYSTEM_EVENT_STA_WPS_ER_TIMEOUT:
    case SYSTEM_EVENT_WIFI_READY:
      #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
        DEBUG_PRINT("[INFO] 'CESP32WifiConnector_WifiEventHandler' - Event received: ");
        DEBUG_PRINT_DEC(pEvent->event_id);
        DEBUG_PRINT_CR;
      #endif
      break;

    default:
      break;
  }

  return ESP_OK;
}

bool CESP32WifiConnector_UpdateConnectionState(CESP32WifiConnector *this, DWORD dwConnectionEvent)
{
  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    DEBUG_PRINT("[INFO] 'CESP32WifiConnector_UpdateConnectionState' - Entering, current state: ");
    DEBUG_PRINT_DEC(this->m_dwConnectionState);
    DEBUG_PRINT_CR;
  #endif

  if (xSemaphoreTake(this->m_hConnectionStateMutex, pdMS_TO_TICKS(1000)) == pdPASS)
  {
    switch (dwConnectionEvent)
    {
      case ESP32WIFICONNECTOR_CONNECTION_EVENT_WIFI_CONNECTED:
      case ESP32WIFICONNECTOR_CONNECTION_EVENT_SERVER_DISCONNECTED:
        this->m_dwConnectionState = ESP32WIFICONNECTOR_CONNECTION_STATE_WIFI_CONNECTED;
        break;
  
      case ESP32WIFICONNECTOR_CONNECTION_EVENT_WIFI_DISCONNECTED:
        if (this->m_hServerSocket >= 0)
        {
          close(this->m_hServerSocket);
          this->m_hServerSocket = -1;
        }
        this->m_dwConnectionState = ESP32WIFICONNECTOR_CONNECTION_STATE_DISCONNECTED;
        break;
  
      case ESP32WIFICONNECTOR_CONNECTION_EVENT_SERVER_CONNECTED:
        this->m_dwConnectionState = ESP32WIFICONNECTOR_CONNECTION_STATE_SERVER_CONNECTED;
        break;

