ffdev-fr/lorawan_esp32_gw/main/ESP32WifiConnector.c
      case ESP32WIFICONNECTOR_CONNECTION_EVENT_SOCKET_OPENED:
        // UDP transport initialized, typically automaton will try to connect Network Server soon
        // (i.e. first connection or reconnection)
        this->m_dwConnectionState = ESP32WIFICONNECTOR_CONNECTION_STATE_SERVER_DISCONNECTED;
        break;
    }

    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
      DEBUG_PRINT("[INFO] 'CESP32WifiConnector_UpdateConnectionState' - State updated: ");
      DEBUG_PRINT_DEC(this->m_dwConnectionState);
      DEBUG_PRINT_CR;
    #endif

    xSemaphoreGive(this->m_hConnectionStateMutex);
    return true;
  }

  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    DEBUG_PRINT_LN("[ERROR] 'CESP32WifiConnector_UpdateConnectionState'- Failed: timed out waiting for mutex");
  #endif

  return false;
}

bool CESP32WifiConnector_JoinWifi(CESP32WifiConnector *this, bool bReconnect)
{
  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    DEBUG_PRINT_LN("[INFO] Entering 'CESP32WifiConnector_JoinWifi'");
  #endif

  // The caller can ask for reconnection to Wifi network
  if (bReconnect == true)
  {
    // Check if connected
    int nEventBits = xEventGroupWaitBits(this->m_hWifiEventGroup, WIFI_EVENT_GROUP_CONNECTED_BIT, 0, 1, 0);
    if (nEventBits & WIFI_EVENT_GROUP_CONNECTED_BIT)
    {
      #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
        DEBUG_PRINT_LN("[INFO] 'CESP32WifiConnector_JoinWifi' - Reconnection required, disconnecting now...");
      #endif
  
      xEventGroupClearBits(this->m_hWifiEventGroup, WIFI_EVENT_GROUP_CONNECTED_BIT);
      if (esp_wifi_disconnect() == ESP_OK)
      {
        xEventGroupWaitBits(this->m_hWifiEventGroup, WIFI_EVENT_GROUP_DISCONNECTED_BIT, 0, 1, portTICK_RATE_MS);
      }
      else
      {
        #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
          DEBUG_PRINT_LN("[ERROR] 'CESP32WifiConnector_JoinWifi' - Failed to disconnect from Wifi network");
        #endif
        return false;
      }
    }
  }

  // Connect station to Wifi network
  bool bError = false;

  wifi_config_t WifiConfig = { 0 };
  strcpy((char*) WifiConfig.sta.ssid, this->m_szWifiSSID);
  strcpy((char*) WifiConfig.sta.password, this->m_szWifiPassword);

  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    DEBUG_PRINT_LN("[INFO] 'CESP32WifiConnector_JoinWifi' - Connecting station now...");
  #endif

  if (esp_wifi_set_mode(WIFI_MODE_STA) != ESP_OK) { bError = true; }
  else if (esp_wifi_set_config(ESP_IF_WIFI_STA, &WifiConfig) != ESP_OK) { bError = true; }
  else if (esp_wifi_connect() != ESP_OK) { bError = true; }
  else 
  {
    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
      DEBUG_PRINT("[INFO] 'CESP32WifiConnector_JoinWifi' - Waiting event group:");
      DEBUG_PRINT_HEX(this->m_hWifiEventGroup);
      DEBUG_PRINT(", for: ");
      DEBUG_PRINT_DEC(this->m_dwWifiJoinTimeoutMillisec);
      DEBUG_PRINT_LN("ms");
    #endif

    xEventGroupWaitBits(this->m_hWifiEventGroup, WIFI_EVENT_GROUP_CONNECTED_BIT, 0, 1, 
                        this->m_dwWifiJoinTimeoutMillisec / portTICK_RATE_MS);

    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
      DEBUG_PRINT_LN("[INFO] 'CESP32WifiConnector_JoinWifi' - Wait done");
    #endif
  }

  if (bError == true ||
      (xEventGroupWaitBits(this->m_hWifiEventGroup, WIFI_EVENT_GROUP_DISCONNECTED_BIT, 0, 1, 0) & WIFI_EVENT_GROUP_DISCONNECTED_BIT))
  {
    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
      DEBUG_PRINT_LN("[ERROR] 'CESP32WifiConnector_JoinWifi' - Failed to connect station to Wifi");
    #endif
    return false;
  }

  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    DEBUG_PRINT_LN("[INFO] 'CESP32WifiConnector_JoinWifi' - Station connected to Wifi");
  #endif
  return true;
}


/*********************************************************************************************
  Private methods (implementation)

  Access to Network Server
*********************************************************************************************/

bool CESP32WifiConnector_BindNetworkServer(CESP32WifiConnector *this)
{
  int hServerSocket;
  int opt;

  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    DEBUG_PRINT_LN("[INFO] Entering 'CESP32WifiConnector_BindNetworkServer'");
  #endif

  hServerSocket = socket(AF_INET, SOCK_DGRAM, IPPROTO_UDP);
  if (hServerSocket < 0) 
  {
    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
      DEBUG_PRINT_LN("[ERROR] 'CESP32WifiConnector_BindNetworkServer' - Unable to create socket");
    #endif
    return false;
  }

  opt = 0;
  setsockopt(hServerSocket, SOL_SOCKET, SO_REUSEADDR, &opt, sizeof(opt));
/*
  addr.sin_family = AF_INET;
  addr.sin_port = 0;
  addr.sin_addr.s_addr = s_iperf_ctrl.cfg.sip;
  if (bind(hServerSocket, (struct sockaddr*) &addr, sizeof(addr)) != 0) 
  {
    close(hServerSocket);
    return false;
  }
*/

  // Retrieve Network Server IP from URL
  const struct addrinfo hints = { .ai_family = AF_INET,
                                  .ai_socktype = SOCK_DGRAM,
                                  .ai_flags = 0,
//                                .ai_protocol = 0,
                                  .ai_protocol = IPPROTO_UDP,
                                };
  struct addrinfo *res;
  struct in_addr *paddr;
  char szPort[16];

  sprintf(szPort, "%d", this->m_dwNetworkServerPort); 
  int err = getaddrinfo(this->m_szNetworkServerUrl, szPort, &hints, &res);

  if (err != 0 || res == NULL) 
  {
    #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
      DEBUG_PRINT_LN("[ERROR] 'CESP32WifiConnector_BindNetworkServer' - DNS lookup failed err=");
      DEBUG_PRINT_DEC(err);
      DEBUG_PRINT_CR;
    #endif
    return false;
  }

  // Store resolved IP.
  // Note: inet_ntoa is non-reentrant, look at ipaddr_ntoa_r for "real" code */
  paddr = &((struct sockaddr_in *)res->ai_addr)->sin_addr;
  strcpy(this->m_szNetworkServerIP, inet_ntoa(*paddr));
  freeaddrinfo(res);

  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    DEBUG_PRINT("[INFO] 'CESP32WifiConnector_BindNetworkServer' - Server IP address is ");
    DEBUG_PRINT_LN(this->m_szNetworkServerIP);
  #endif


  this->m_ServerSockAddr.sin_family = AF_INET;
  this->m_ServerSockAddr.sin_port = htons(this->m_dwNetworkServerPort);
  this->m_ServerSockAddr.sin_addr.s_addr = ipaddr_addr(this->m_szNetworkServerIP);

  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    DEBUG_PRINT("[INFO] 'CESP32WifiConnector_BindNetworkServer' - Server network address is ");
    DEBUG_PRINT_HEX(this->m_ServerSockAddr.sin_addr.s_addr);
    DEBUG_PRINT_CR;
  #endif


  // Network Server IP retrieved, UDP socket ready 
  this->m_hServerSocket = hServerSocket;
  CESP32WifiConnector_UpdateConnectionState(this, ESP32WIFICONNECTOR_CONNECTION_EVENT_SOCKET_OPENED);

  return true;
}

/*********************************************************************************************
  Private methods (implementation)

  SNTP Server activation and RTC time update
*********************************************************************************************/

bool CESP32WifiConnector_ConnectSNTPServer(CESP32WifiConnector *this, char *pSNTPServerUrl, DWORD dwSNTPServerPeriodSec)
{
  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    DEBUG_PRINT_LN("[INFO] Entering 'CESP32WifiConnector_ConnectSNTPServer'");
  #endif

  // Initialize SNTP utility
  sntp_setoperatingmode(SNTP_OPMODE_POLL);
  sntp_setservername(0, pSNTPServerUrl);
  sntp_init();

  // Wait for ESP32 RTC module update
  
  setenv("TZ", "CET-1", 1);
  tzset();

  time_t timeNow = 0;
  struct tm tmTimeinfo = { 0 };
  int nRetryCount = 0;

  while (tmTimeinfo.tm_year < (2017 - 1900) && ++nRetryCount < 10) 
  {
    vTaskDelay(2000 / portTICK_PERIOD_MS);
    time(&timeNow);
    localtime_r(&timeNow, &tmTimeinfo);
  }

  #if (ESP32WIFICONNECTOR_DEBUG_LEVEL0)
    if (nRetryCount < 10)
    {
      DEBUG_PRINT("[INFO] 'CESP32WifiConnector_ConnectSNTPServer - System time: '");
      DEBUG_PRINT_DEC(timeNow);
      DEBUG_PRINT_CR;
    }
  #endif

  return nRetryCount < 10 ? true : false;
}

